Back-end/app/Controllers/Admin.php

SELECT *
FROM `funcionarios`
WHERE `id` = 'null'
SELECT *
FROM `funcionarios`
---
    public function buscar(){
        $json = file_get_contents('php://input');
        $datajson = json_decode($json, true);

        $dados = $this->modelcli->select('c.id, c.nome AS cliente_nome, c.CPF, c.email,c.personal_id, p.nome AS nome_personal')
        ->from('cliente AS c')
        ->join('funcionarios AS p', 'c.personal_id = p.id', 'INNER')
        ->where('c.id', $datajson['id'])
        ->groupBy('c.id');

        $data = $dados->get();

        return $this->response->setJSON($data->getResult())->setStatusCode(200);