Back-end/app/Controllers/Ficha.php

SELECT `fichas`.`id` AS `ficha_id`, `fichas`.`tipo`, `fichas`.`ordem`, `fichas`.`concluida`, `ficha_exercicios`.`id` AS `ficha_exercicio_id`, `exercicios`.`nome` AS `exercicio`, `grupos_musculares`.`nome` AS `grupo_muscular`, `ficha_exercicios`.`repeticoes`, `ficha_exercicios`.`series`, `ficha_exercicios`.`observacoes`
FROM `fichas`
JOIN `ficha_exercicios` ON `ficha_exercicios`.`ficha_id` = `fichas`.`id`
JOIN `exercicios` ON `exercicios`.`id` = `ficha_exercicios`.`exercicio_id`
JOIN `grupos_musculares` ON `grupos_musculares`.`id` = `exercicios`.`grupo_muscular_id`
WHERE `fichas`.`cliente_id` = '70'
ORDER BY `fichas`.`ordem` ASC
---
    public function pesquisarCli()
    {
        try {
            $clienteId = $this->request->getJSON();

            if (isset($clienteId->soficha)) {
                $fichas = $this->fichamodel
                    ->where('cliente_id', $clienteId->id)
                    ->orderBy('ordem', 'ASC')
                    ->findAll();
            } else {
                $fichas = $this->fichamodel
                    ->select('fichas.id AS ficha_id, fichas.tipo, fichas.ordem, fichas.concluida,
                          ficha_exercicios.id AS ficha_exercicio_id, exercicios.nome AS exercicio,
                          grupos_musculares.nome AS grupo_muscular,
                          ficha_exercicios.repeticoes,
                          ficha_exercicios.series, ficha_exercicios.observacoes')
                    ->join('ficha_exercicios', 'ficha_exercicios.ficha_id = fichas.id')
                    ->join('exercicios', 'exercicios.id = ficha_exercicios.exercicio_id')
                    ->join('grupos_musculares', 'grupos_musculares.id = exercicios.grupo_muscular_id')
                    ->where('fichas.cliente_id', $clienteId->id)
                    ->orderBy('fichas.ordem', 'ASC')
                    ->findAll();