Back-end/app/Controllers/Financeiro.php

SELECT SUM(CAST(REPLACE(REPLACE(valor, "R$", ""), ", ", ".") AS DECIMAL(10, 2)))
FROM `pagamentos`
WHERE `data_pagamento` LIKE '%2025-06%' ESCAPE '!'
AND   (
`status_pagamento` = 'pago'
OR `status_pagamento` = 'success'
 )
 LIMIT 1
SELECT SUM(total) AS total
FROM `loja_vendas`
WHERE `data_venda` LIKE '2025-06%' ESCAPE '!'
 LIMIT 1
SELECT SUM(valor) as valor
FROM `despesas`
WHERE `data` LIKE '2025-06%' ESCAPE '!'
 LIMIT 1
---
    public function resumo()
    {
        $mes = $this->request->getGet('mes');
        $ano = $this->request->getGet('ano');


        // Total de pagamentos com status 'pago' ou 'success'
        $pagamentos = $this->pagamentoModel
            ->select('SUM(CAST(REPLACE(REPLACE(valor, "R$", ""), ",", ".") AS DECIMAL(10,2)))', 'total_valor')
            ->like('data_pagamento', "$ano-$mes")
            ->groupStart()
            ->where('status_pagamento', 'pago')
            ->orWhere('status_pagamento', 'success')
            ->groupEnd()
            ->first()['total_valor'] ?? 0;

        // Total de vendas
        $vendas = $this->vendaModel
            ->select('SUM(total) AS total')
            ->like('data_venda', "$ano-$mes", 'after')
            ->first()['total'] ?? 0;

        // Total de despesas
        $despesas = $this->despesaModel
            ->select('SUM(valor) as valor')
            ->like('data', "$ano-$mes", 'after')
            ->first()['valor'] ?? 0;

SELECT COUNT(*) AS `numrows`
FROM `cliente`
WHERE `status` = 'ativo'
SELECT COUNT(*) AS `numrows`
FROM `pagamentos`
WHERE `status_pagamento` = 'pendente'
---
        $lucro = floatval($pagamentos) + floatval($vendas) - floatval($despesas);

        // Dados adicionais para análise
        $totalClientes = (new ClienteModel())
            ->where('status', 'ativo')
            ->countAllResults();

        $pagamentosPendentes = $this->pagamentoModel
            ->where('status_pagamento', 'pendente')
            ->countAllResults();

SELECT *
FROM `despesas`
ORDER BY `data` DESC
---
    public function listaDespesas()
    {
        $data = $this->despesaModel
            ->orderBy('data', 'DESC')
            ->findAll();