Back-end/app/Controllers/Loja.php

    public function read()
    {
        try {
            // Inserção no banco de dados
            $dados = $this->lojaProdutos->findAll();
---
SELECT *
FROM `loja_produtos`